#### TranslationRotationValue Enumeration

---

|  |
| --- |
| See Also |

Specifies the type of condition applied to the translation or rotation parameter.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public enum TranslationRotationValue ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TranslationRotationValue ``` |

| Visual C++ |
| --- |
| ``` public enum class TranslationRotationValue ``` |

# Members

| Member name | Description |
| --- | --- |
| Fixed | The type of condition is Fixed. |
| Release | The type of condition is Release. |
| Spring | The type of condition is Spring. |

# See Also

Autodesk.Revit.DB.Structure Namespace